Revit 2026 API
CurveLoop.CreateViaOffset Method
Overload List
Name | Description
CreateViaOffset(CurveLoop, IList<Double>, XYZ)
CreateViaOffset(CurveLoop, Double, XYZ) |  Creates a new curve loop that is an offset of the existing curve loop.
Top
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace